Белгипрозем_2017/src/Catalogs/СерверныеСообщенияСВД/СерверныеСообщенияСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверныеСообщенияСВД</name>
  <attributes>
    <name>ДатаОтправкиПолучателю</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияСервером</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтКого</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>CatalogRef.ФорматыСообщенийСВД</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ТипыХраненияФайлов/ТипыХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыХраненияФайлов</name>
  <enumValues>
    <name>ВИнформационнойБазе</name>
  </enumValues>
  <enumValues>
    <name>ВТомахНаДиске</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/СерверныеСообщенияСВД/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОтправленоПриИзменении(Элемент)
	
	Если НЕ Объект.Отправлено Тогда
		Объект.ДатаОтправкиПолучателю = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьСообщение(Команда)
	
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка);
	Если МассивФайлов.Количество() = 1 Тогда
		ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляОткрытия(МассивФайлов[0]);
		КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка);
	Если МассивФайлов.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	ФайлСсылка = МассивФайлов[0];
	
	ТекущаяВерсия = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ФайлСсылка, "ТекущаяВерсия");
	ТипХраненияФайла = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущаяВерсия, "ТипХраненияФайла");
	
	ИмяФайлаСПутем = РаботаСФайламиВызовСервера.ПолучитьИмяФайлаСПутемКДвоичнымДанным(ТекущаяВерсия);
	
	ПространствоИмен = РаботаССВД.ПолучитьПространствоИмен(Объект.ФорматСообщения);
	
	//МиСофт+
	ЧтениеФайла = Новый ТекстовыйДокумент();
	ЧтениеФайла.Прочитать(ИмяФайлаСПутем, КодировкаТекста.UTF8);
	ЗаписьФайла = Новый ТекстовыйДокумент();
	Для ТекущаяСтрока=1 По ЧтениеФайла.КоличествоСтрок() Цикл
		Стр = ЧтениеФайла.ПолучитьСтроку(ТекущаяСтрока);
		Если Найти(Стр, "<Envelop")>0 И Найти(Стр, "http://www.1c.ru/medosignedby")=0 Тогда
			Стр = СтрЗаменить(Стр, "<Envelop", "<Envelop xmlns='http://www.1c.ru/medosignedby' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'");
		КонецЕсли;
		ЗаписьФайла.ДобавитьСтроку(Стр);
	КонецЦикла;
	ЗаписьФайла.Записать(ИмяФайлаСПутем, КодировкаТекста.UTF8);
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "Envelop");
	//МиСофт-
	ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ИмяФайлаСПутем);
    ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
    ОбъектXDTO.Проверить();
	ЧтениеXML.Закрыть();

	Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		УдалитьФайлы(ИмяФайлаСПутем);
	КонецЕсли;
	
	// Отображаем ОбъектXDTO в HTML
	РаботаССВД.ЗаполнитьHTMLПоXDTO(ТекстHTML, ОбъектXDTO);
	
КонецПроцедуры
